config/packages/dev/models/checkout/checkout.dot
digraph workflow {
  ratio="compress" rankdir="LR" label=""
  node [fontsize="9" fontname="Arial" color="#333333" fillcolor="lightblue" fixedsize="false" width="1"];
  edge [fontsize="9" fontname="Arial" color="#333333" arrowhead="normal" arrowsize="0.5"];

  place_e83249bd3ba79932e16fb1fb5100dafade9954c2 [label="home", shape=circle, style="filled"];
  place_be8df8efa2cb6b2300fe2f82d8d9b19d4d9f3006 [label="awaitingPersonalDetails", shape=circle];
  place_636a9cc7645cbe8e1dacce71000bb0db745a39e1 [label="awaitingPassword", shape=circle];
  place_b5da8f0027407937d7b9d6199a5d40d174c2661a [label="personalDetailsFilled", shape=circle];
  place_133afdf482fd18037e3a0e10ed8a6ab4f9161d40 [label="passwordFilled", shape=circle];
  place_bbcddce3edfbf6793be4e1761595ad9dd36cf0fb [label="billingAddressFilled", shape=circle];
  place_8df9aa6c1a8fbc2bf1fff5c5d67d147e334f94cf [label="awaitingAccount", shape=circle];
  place_e8718de4f73418b4e1c7ad5c42bec684a4a9caa9 [label="awaitingBillingAddress", shape=circle];
  place_5c3d4bc6d2c208e711fdf92d53725814b3f6c097 [label="awaitingNameAndBillingAddress", shape=circle];
  place_95c4228878ef8ed807e02b7e17abad8cfa27a63b [label="awaitingDeliveryAddress", shape=circle];
  place_db2a0e8a240c19feca6bf300b83c712f43d74c07 [label="awaitingDeliveryMethod", shape=circle];
  place_866591cec37483a4a6ab3489cb867167720a8a29 [label="awaitingPaymentMethod", shape=circle];
  place_4e213a3d74384d58db66bd928b2ccd8538875562 [label="awaitingOrderConfirm", shape=circle];
  place_a2b5ee046fd493f24a42236ed96bf6391e7dd3bb [label="accountAdded", shape=circle];
  place_4b91121f15dd396c0ae165be0700915d1c031185 [label="billingAddressAdded", shape=circle];
  place_d28a622a32ba5df0dab0c01e924c0b2dc9456cd8 [label="deliveryAddressAdded", shape=circle];
  place_28aae0f120be48f4f0ba56d7a75699965ccaa214 [label="deliveryMethodAdded", shape=circle];
  place_098279e686d64d36fd9ddfd5d8eed3773751c874 [label="paymentMethodAdded", shape=circle];
  place_cbeec9c5b8f73f7335a9b9606865084b73d6db44 [label="orderPlaced", shape=circle];
  transition_2ac776141d84009da79b006b4dec8054691a5c5f [label="addProductAndCheckoutNotLoggedIn", shape=box, shape="box", regular="1"];
  transition_578a40e5a7bc3a0474371867ac2173acd5bf516c [label="addProductAndCheckoutLoggedIn", shape=box, shape="box", regular="1"];
  transition_2736fab291f04e69b62d490c3c09361f5b82461a [label="login", shape=box, shape="box", regular="1"];
  transition_1b8a31d24f7e7b4bb00f985657ef664c0fd484f7 [label="guestCheckout", shape=box, shape="box", regular="1"];
  transition_4a67e46d8a1b96a2f1ebfa90009ae18258516248 [label="registerAccount", shape=box, shape="box", regular="1"];
  transition_901c5f630db8b0e18779359c8d949e4395268689 [label="useExistingBillingAddress", shape=box, shape="box", regular="1"];
  transition_fe12c392e32e62dd39eccef4248a39e19252acdf [label="useNewBillingAddress", shape=box, shape="box", regular="1"];
  transition_6ca7bb9639941de4f3d43da60a79d965e688398c [label="fillPersonalDetails", shape=box, shape="box", regular="1"];
  transition_3564e2bbe48b061a3985d46ebf9bb36a0c94de0e [label="fillPassword", shape=box, shape="box", regular="1"];
  transition_88846e7311af81ea2b6eb30ced42e8e9a035674e [label="fillBillingAddress", shape=box, shape="box", regular="1"];
  transition_8c17eddce8897d792f6edb1cd3ada98544ed0488 [label="addNameAndBillingAddress", shape=box, shape="box", regular="1"];
  transition_b9afdfce139e25e36eeb6c8758d70a895bf0779a [label="registerAndAddBillingAddress", shape=box, shape="box", regular="1"];
  transition_410c1682a9f476d29d39068a6c532ff661a85b60 [label="guestCheckoutAndAddBillingAddress", shape=box, shape="box", regular="1"];
  transition_40f7b37f0743d75d1323955148aa023e7533d8af [label="useExistingDeliveryAddress", shape=box, shape="box", regular="1"];
  transition_40d8c3069664fee3e86bfcb2c57fcf2ef837a066 [label="useNewDeliveryAddress", shape=box, shape="box", regular="1"];
  transition_df57db0e976add4f8115fb49f751571ed8e60c9e [label="addDeliveryMethod", shape=box, shape="box", regular="1"];
  transition_752bfd756f267a2d9e4dbb70f2b8c487d606f886 [label="addPaymentMethod", shape=box, shape="box", regular="1"];
  transition_f158550b6472279811abb832e1fa84c33a264bd1 [label="confirmOrder", shape=box, shape="box", regular="1"];
  transition_f5f67f37bdb26da1aa426f3f570c10051eb8a1f6 [label="continueShopping", shape=box, shape="box", regular="1"];
  place_e83249bd3ba79932e16fb1fb5100dafade9954c2 -> transition_2ac776141d84009da79b006b4dec8054691a5c5f [style="solid"];
  transition_2ac776141d84009da79b006b4dec8054691a5c5f -> place_8df9aa6c1a8fbc2bf1fff5c5d67d147e334f94cf [style="solid"];
  place_e83249bd3ba79932e16fb1fb5100dafade9954c2 -> transition_578a40e5a7bc3a0474371867ac2173acd5bf516c [style="solid"];
  transition_578a40e5a7bc3a0474371867ac2173acd5bf516c -> place_a2b5ee046fd493f24a42236ed96bf6391e7dd3bb [style="solid"];
  transition_578a40e5a7bc3a0474371867ac2173acd5bf516c -> place_e8718de4f73418b4e1c7ad5c42bec684a4a9caa9 [style="solid"];
  place_8df9aa6c1a8fbc2bf1fff5c5d67d147e334f94cf -> transition_2736fab291f04e69b62d490c3c09361f5b82461a [style="solid"];
  transition_2736fab291f04e69b62d490c3c09361f5b82461a -> place_a2b5ee046fd493f24a42236ed96bf6391e7dd3bb [style="solid"];
  transition_2736fab291f04e69b62d490c3c09361f5b82461a -> place_5c3d4bc6d2c208e711fdf92d53725814b3f6c097 [style="solid"];
  place_8df9aa6c1a8fbc2bf1fff5c5d67d147e334f94cf -> transition_1b8a31d24f7e7b4bb00f985657ef664c0fd484f7 [style="solid"];
  transition_1b8a31d24f7e7b4bb00f985657ef664c0fd484f7 -> place_be8df8efa2cb6b2300fe2f82d8d9b19d4d9f3006 [style="solid"];
  transition_1b8a31d24f7e7b4bb00f985657ef664c0fd484f7 -> place_e8718de4f73418b4e1c7ad5c42bec684a4a9caa9 [style="solid"];
  place_8df9aa6c1a8fbc2bf1fff5c5d67d147e334f94cf -> transition_4a67e46d8a1b96a2f1ebfa90009ae18258516248 [style="solid"];
  transition_4a67e46d8a1b96a2f1ebfa90009ae18258516248 -> place_be8df8efa2cb6b2300fe2f82d8d9b19d4d9f3006 [style="solid"];
  transition_4a67e46d8a1b96a2f1ebfa90009ae18258516248 -> place_636a9cc7645cbe8e1dacce71000bb0db745a39e1 [style="solid"];
  transition_4a67e46d8a1b96a2f1ebfa90009ae18258516248 -> place_e8718de4f73418b4e1c7ad5c42bec684a4a9caa9 [style="solid"];
  place_5c3d4bc6d2c208e711fdf92d53725814b3f6c097 -> transition_901c5f630db8b0e18779359c8d949e4395268689 [style="solid"];
  transition_901c5f630db8b0e18779359c8d949e4395268689 -> place_4b91121f15dd396c0ae165be0700915d1c031185 [style="solid"];
  transition_901c5f630db8b0e18779359c8d949e4395268689 -> place_95c4228878ef8ed807e02b7e17abad8cfa27a63b [style="solid"];
  place_5c3d4bc6d2c208e711fdf92d53725814b3f6c097 -> transition_fe12c392e32e62dd39eccef4248a39e19252acdf [style="solid"];
  transition_fe12c392e32e62dd39eccef4248a39e19252acdf -> place_4b91121f15dd396c0ae165be0700915d1c031185 [style="solid"];
  transition_fe12c392e32e62dd39eccef4248a39e19252acdf -> place_95c4228878ef8ed807e02b7e17abad8cfa27a63b [style="solid"];
  place_be8df8efa2cb6b2300fe2f82d8d9b19d4d9f3006 -> transition_6ca7bb9639941de4f3d43da60a79d965e688398c [style="solid"];
  transition_6ca7bb9639941de4f3d43da60a79d965e688398c -> place_b5da8f0027407937d7b9d6199a5d40d174c2661a [style="solid"];
  place_636a9cc7645cbe8e1dacce71000bb0db745a39e1 -> transition_3564e2bbe48b061a3985d46ebf9bb36a0c94de0e [style="solid"];
  transition_3564e2bbe48b061a3985d46ebf9bb36a0c94de0e -> place_133afdf482fd18037e3a0e10ed8a6ab4f9161d40 [style="solid"];
  place_e8718de4f73418b4e1c7ad5c42bec684a4a9caa9 -> transition_88846e7311af81ea2b6eb30ced42e8e9a035674e [style="solid"];
  transition_88846e7311af81ea2b6eb30ced42e8e9a035674e -> place_bbcddce3edfbf6793be4e1761595ad9dd36cf0fb [style="solid"];
  place_5c3d4bc6d2c208e711fdf92d53725814b3f6c097 -> transition_8c17eddce8897d792f6edb1cd3ada98544ed0488 [style="solid"];
  transition_8c17eddce8897d792f6edb1cd3ada98544ed0488 -> place_4b91121f15dd396c0ae165be0700915d1c031185 [style="solid"];
  transition_8c17eddce8897d792f6edb1cd3ada98544ed0488 -> place_95c4228878ef8ed807e02b7e17abad8cfa27a63b [style="solid"];
  place_b5da8f0027407937d7b9d6199a5d40d174c2661a -> transition_b9afdfce139e25e36eeb6c8758d70a895bf0779a [style="solid"];
  place_133afdf482fd18037e3a0e10ed8a6ab4f9161d40 -> transition_b9afdfce139e25e36eeb6c8758d70a895bf0779a [style="solid"];
  place_bbcddce3edfbf6793be4e1761595ad9dd36cf0fb -> transition_b9afdfce139e25e36eeb6c8758d70a895bf0779a [style="solid"];
  transition_b9afdfce139e25e36eeb6c8758d70a895bf0779a -> place_a2b5ee046fd493f24a42236ed96bf6391e7dd3bb [style="solid"];
  transition_b9afdfce139e25e36eeb6c8758d70a895bf0779a -> place_4b91121f15dd396c0ae165be0700915d1c031185 [style="solid"];
  transition_b9afdfce139e25e36eeb6c8758d70a895bf0779a -> place_95c4228878ef8ed807e02b7e17abad8cfa27a63b [style="solid"];
  place_b5da8f0027407937d7b9d6199a5d40d174c2661a -> transition_410c1682a9f476d29d39068a6c532ff661a85b60 [style="solid"];
  place_bbcddce3edfbf6793be4e1761595ad9dd36cf0fb -> transition_410c1682a9f476d29d39068a6c532ff661a85b60 [style="solid"];
  transition_410c1682a9f476d29d39068a6c532ff661a85b60 -> place_a2b5ee046fd493f24a42236ed96bf6391e7dd3bb [style="solid"];
  transition_410c1682a9f476d29d39068a6c532ff661a85b60 -> place_4b91121f15dd396c0ae165be0700915d1c031185 [style="solid"];
  transition_410c1682a9f476d29d39068a6c532ff661a85b60 -> place_95c4228878ef8ed807e02b7e17abad8cfa27a63b [style="solid"];
  place_95c4228878ef8ed807e02b7e17abad8cfa27a63b -> transition_40f7b37f0743d75d1323955148aa023e7533d8af [style="solid"];
  transition_40f7b37f0743d75d1323955148aa023e7533d8af -> place_d28a622a32ba5df0dab0c01e924c0b2dc9456cd8 [style="solid"];
  transition_40f7b37f0743d75d1323955148aa023e7533d8af -> place_db2a0e8a240c19feca6bf300b83c712f43d74c07 [style="solid"];
  place_95c4228878ef8ed807e02b7e17abad8cfa27a63b -> transition_40d8c3069664fee3e86bfcb2c57fcf2ef837a066 [style="solid"];
  transition_40d8c3069664fee3e86bfcb2c57fcf2ef837a066 -> place_d28a622a32ba5df0dab0c01e924c0b2dc9456cd8 [style="solid"];
  transition_40d8c3069664fee3e86bfcb2c57fcf2ef837a066 -> place_db2a0e8a240c19feca6bf300b83c712f43d74c07 [style="solid"];
  place_db2a0e8a240c19feca6bf300b83c712f43d74c07 -> transition_df57db0e976add4f8115fb49f751571ed8e60c9e [style="solid"];
  transition_df57db0e976add4f8115fb49f751571ed8e60c9e -> place_28aae0f120be48f4f0ba56d7a75699965ccaa214 [style="solid"];
  transition_df57db0e976add4f8115fb49f751571ed8e60c9e -> place_866591cec37483a4a6ab3489cb867167720a8a29 [style="solid"];
  place_866591cec37483a4a6ab3489cb867167720a8a29 -> transition_752bfd756f267a2d9e4dbb70f2b8c487d606f886 [style="solid"];
  transition_752bfd756f267a2d9e4dbb70f2b8c487d606f886 -> place_098279e686d64d36fd9ddfd5d8eed3773751c874 [style="solid"];
  transition_752bfd756f267a2d9e4dbb70f2b8c487d606f886 -> place_4e213a3d74384d58db66bd928b2ccd8538875562 [style="solid"];
  place_a2b5ee046fd493f24a42236ed96bf6391e7dd3bb -> transition_f158550b6472279811abb832e1fa84c33a264bd1 [style="solid"];
  place_4b91121f15dd396c0ae165be0700915d1c031185 -> transition_f158550b6472279811abb832e1fa84c33a264bd1 [style="solid"];
  place_d28a622a32ba5df0dab0c01e924c0b2dc9456cd8 -> transition_f158550b6472279811abb832e1fa84c33a264bd1 [style="solid"];
  place_28aae0f120be48f4f0ba56d7a75699965ccaa214 -> transition_f158550b6472279811abb832e1fa84c33a264bd1 [style="solid"];
  place_098279e686d64d36fd9ddfd5d8eed3773751c874 -> transition_f158550b6472279811abb832e1fa84c33a264bd1 [style="solid"];
  place_4e213a3d74384d58db66bd928b2ccd8538875562 -> transition_f158550b6472279811abb832e1fa84c33a264bd1 [style="solid"];
  transition_f158550b6472279811abb832e1fa84c33a264bd1 -> place_cbeec9c5b8f73f7335a9b9606865084b73d6db44 [style="solid"];
  place_cbeec9c5b8f73f7335a9b9606865084b73d6db44 -> transition_f5f67f37bdb26da1aa426f3f570c10051eb8a1f6 [style="solid"];
  transition_f5f67f37bdb26da1aa426f3f570c10051eb8a1f6 -> place_e83249bd3ba79932e16fb1fb5100dafade9954c2 [style="solid"];
}
