config/packages/dev/models/checkout/checkout.plantuml
@startuml
allow_mixing
title checkout
skinparam titleBorderRoundCorner 15
skinparam titleBorderThickness 2
skinparam state {
    BackgroundColor<<initial>> #87b741
    BackgroundColor<<marked>> #3887C6
    BorderColor #3887C6
    BorderColor<<marked>> Black
    FontColor<<marked>> White
}
skinparam agent {
    BackgroundColor #ffffff
    BorderColor #3887C6
}
state "home" <<initial>>
state "awaitingPersonalDetails"
state "awaitingPassword"
state "personalDetailsFilled"
state "passwordFilled"
state "billingAddressFilled"
state "awaitingAccount"
state "awaitingBillingAddress"
state "awaitingNameAndBillingAddress"
state "awaitingDeliveryAddress"
state "awaitingDeliveryMethod"
state "awaitingPaymentMethod"
state "awaitingOrderConfirm"
state "accountAdded"
state "billingAddressAdded"
state "deliveryAddressAdded"
state "deliveryMethodAdded"
state "paymentMethodAdded"
state "orderPlaced"
agent "addProductAndCheckoutNotLoggedIn"
agent "addProductAndCheckoutLoggedIn"
agent "login"
agent "guestCheckout"
agent "registerAccount"
agent "useExistingBillingAddress"
agent "useNewBillingAddress"
agent "fillPersonalDetails"
agent "fillPassword"
agent "fillBillingAddress"
agent "addNameAndBillingAddress"
agent "registerAndAddBillingAddress"
agent "guestCheckoutAndAddBillingAddress"
agent "useExistingDeliveryAddress"
agent "useNewDeliveryAddress"
agent "addDeliveryMethod"
agent "addPaymentMethod"
agent "confirmOrder"
agent "continueShopping"
"home" --> "addProductAndCheckoutNotLoggedIn"
"addProductAndCheckoutNotLoggedIn" --> "awaitingAccount"
"home" --> "addProductAndCheckoutLoggedIn"
"addProductAndCheckoutLoggedIn" --> "accountAdded"
"addProductAndCheckoutLoggedIn" --> "awaitingBillingAddress"
"awaitingAccount" --> "login"
"login" --> "accountAdded"
"login" --> "awaitingNameAndBillingAddress"
"awaitingAccount" --> "guestCheckout"
"guestCheckout" --> "awaitingPersonalDetails"
"guestCheckout" --> "awaitingBillingAddress"
"awaitingAccount" --> "registerAccount"
"registerAccount" --> "awaitingPersonalDetails"
"registerAccount" --> "awaitingPassword"
"registerAccount" --> "awaitingBillingAddress"
"awaitingNameAndBillingAddress" --> "useExistingBillingAddress"
"useExistingBillingAddress" --> "billingAddressAdded"
"useExistingBillingAddress" --> "awaitingDeliveryAddress"
"awaitingNameAndBillingAddress" --> "useNewBillingAddress"
"useNewBillingAddress" --> "billingAddressAdded"
"useNewBillingAddress" --> "awaitingDeliveryAddress"
"awaitingPersonalDetails" --> "fillPersonalDetails"
"fillPersonalDetails" --> "personalDetailsFilled"
"awaitingPassword" --> "fillPassword"
"fillPassword" --> "passwordFilled"
"awaitingBillingAddress" --> "fillBillingAddress"
"fillBillingAddress" --> "billingAddressFilled"
"awaitingNameAndBillingAddress" --> "addNameAndBillingAddress"
"addNameAndBillingAddress" --> "billingAddressAdded"
"addNameAndBillingAddress" --> "awaitingDeliveryAddress"
"personalDetailsFilled" --> "registerAndAddBillingAddress"
"registerAndAddBillingAddress" --> "accountAdded"
"registerAndAddBillingAddress" --> "billingAddressAdded"
"registerAndAddBillingAddress" --> "awaitingDeliveryAddress"
"passwordFilled" --> "registerAndAddBillingAddress"
"billingAddressFilled" --> "registerAndAddBillingAddress"
"personalDetailsFilled" --> "guestCheckoutAndAddBillingAddress"
"guestCheckoutAndAddBillingAddress" --> "accountAdded"
"guestCheckoutAndAddBillingAddress" --> "billingAddressAdded"
"guestCheckoutAndAddBillingAddress" --> "awaitingDeliveryAddress"
"billingAddressFilled" --> "guestCheckoutAndAddBillingAddress"
"awaitingDeliveryAddress" --> "useExistingDeliveryAddress"
"useExistingDeliveryAddress" --> "deliveryAddressAdded"
"useExistingDeliveryAddress" --> "awaitingDeliveryMethod"
"awaitingDeliveryAddress" --> "useNewDeliveryAddress"
"useNewDeliveryAddress" --> "deliveryAddressAdded"
"useNewDeliveryAddress" --> "awaitingDeliveryMethod"
"awaitingDeliveryMethod" --> "addDeliveryMethod"
"addDeliveryMethod" --> "deliveryMethodAdded"
"addDeliveryMethod" --> "awaitingPaymentMethod"
"awaitingPaymentMethod" --> "addPaymentMethod"
"addPaymentMethod" --> "paymentMethodAdded"
"addPaymentMethod" --> "awaitingOrderConfirm"
"accountAdded" --> "confirmOrder"
"confirmOrder" --> "orderPlaced"
"billingAddressAdded" --> "confirmOrder"
"deliveryAddressAdded" --> "confirmOrder"
"deliveryMethodAdded" --> "confirmOrder"
"paymentMethodAdded" --> "confirmOrder"
"awaitingOrderConfirm" --> "confirmOrder"
"orderPlaced" --> "continueShopping"
"continueShopping" --> "home"
@enduml
